//=============================================================================
//
// メイン処理 [main.h]
// Author : 
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <windows.h>
#include "d3dx9.h"						//描画処理に必要
#define DIRECTINPUT_VERSION (0x0800)
#include "dinput.h"						//入力処理に必要
#pragma comment (lib,"dinput8.lib")		//入力処理に必要
#include "xaudio2.h"					//サウンド再生に必要


//*****************************************************************************
// ライブラリファイルのリンク
//*****************************************************************************
#pragma comment(lib, "d3d9.lib")		//描画処理
#pragma comment(lib, "d3dx9.lib")		//描画処理
#pragma comment(lib, "dxguid.lib")		//描画処理
#pragma comment(lib, "winmm.lib")		//FPS


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCREEN_WIDTH (1280)				//画面の幅
#define SCREEN_HEIGHT (1080)			//画面の高さ
#define FVF_VERTEX_2D (D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)
#define SCREEN_X (500)
#define SCREEN_Y (500)
#define MAX_DATA (10)

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
int GetFPS(void);

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		//頂点座標
	float rhw;				//1.0で固定
	D3DCOLOR col;			//頂点カラー
	D3DXVECTOR2 tex;		//テクスチャ座標
}VERTEX_2D;

#endif